const Learn = () => {
    const sections = [
        {
            title: "تحقیقات مبانی و طراحی UX",
            content: `طراحی محصول با درک نیازهای کاربران شروع می شود که از طریق تحقیقات جامع جمع آوری می شود. اصول اصلی طراحی انسان محور و نحوه حل مناسب یک مشکل طراحی را بیاموزید. درک نحوه همدلی با کاربران هنگام انجام تحقیقات کاربر، از جمله نحوه انجام مصاحبه های عمیق و ایجاد نظرسنجی های کمی، و استفاده از داده های تحقیق برای کشف فرصت ها. سپس روانشناسی را برای طراحی طرح ها به کار می گیرید و کاربر نهایی را در ذهن نگه می دارید.`,
        },
        {
            title: "مفهوم نمونه سازی  Low-Fidelity",
            content: `بهترین محصولات بر اساس تحقیقات و بازخورد کاربران دورهای تکرار را پشت سر گذاشته اند. فرآیند یک سرعت طراحی را بیاموزید و چگونه یافته‌های تحقیق را به یک نمونه اولیه که می‌تواند با کاربران آزمایش شود، ترجمه کنید. درک چگونگی تقویت همکاری تیمی و استفاده از تفکر واگرا و همگرا برای ایجاد سریع نمونه های آزمایشی. اصول رابط کاربری را در طراحی یک نمونه اولیه قابل کلیک اعمال کنید و یک تست قابلیت استفاده را برای به دست آوردن بازخورد ارزشمند از کاربران که می تواند در تکرارهای طراحی استفاده شود، انجام دهید.`,
        },
        {
            title: "نمونه سازی High-Fidelity تا تجزیه و تحلیل Post-Launch",
            content: `هنگامی که محصولات از نظر اثربخشی آزمایش شدند، باید برای تعامل تقویت شوند. اصول رابط کاربری پیشرفته را بیاموزید تا طرح های تعاملی بسازید که آماده تحویل به مهندسی برای بازخورد هستند. درک چگونگی درخواست و ادغام بازخورد از مهندسی برای بهبود طراحی قبل از آماده شدن برای توسعه. تعامل محصول را از طریق آزمایش قابلیت استفاده از راه دور و سایر روش‌های آزمایشی ارزیابی کنید. در نهایت، نحوه بهبود طراحی و تجربیات کاربر بر اساس داده‌های تعامل به منظور افزایش شاخص‌های کلیدی عملکرد را خواهید آموخت.`,
        },
        {
            title: "CAPSTONE - طراحی نمونه کاره",
            content: `طراحان UX مهارت های خود را با نمایش طرح ها و فرآیندهای خود در یک نمونه کار نشان می دهند. درک آنچه باید و نباید در یک نمونه کارها گنجانده شود، و همچنین اجزای کلیدی که برای مخاطبان هدف جذاب هستند. یاد بگیرید که چگونه کار قبلی را سازماندهی کنید و با آن به صورت آنلاین ارتباط برقرار کنید و مخاطبان و اهداف شغلی خود را در نظر داشته باشید. چارچوب های داستان سرایی و برندسازی را برای ایجاد یک نمایه شخصی که ارزش پیشنهادی منحصر به فردی را منتقل می کند، اعمال کنید. همچنین بهترین روش‌ها را برای حفظ و به‌روزرسانی پورتفولیوی UX یاد خواهید گرفت.`,
        },
    ];

    return (
        <div className="flex  pt-[56px] max-md:justidy-center pr-[8.6%]">
            <div className="w-[87%] lg:w-[54%]">
                <h1 className="text-[20px] md:text-[28px] text-[#101828] font-bold pr-3 mb-6">
                    چه چیزی یاد می‌گیریم؟
                </h1>

                <div className="relative">
                    {/* خط تایم‌لاین عمودی */}
                    <div className="absolute right-3 top-0 bottom-0 border-r-2 border-dashed border-green-500 z-0"></div>

                    {sections.map((section, index) => (
                        <div key={index} className="relative pr-10 mb-12">
                            {/* دایره روی خط تایم‌لاین */}
                            <div className="absolute right-0  z-10">
                                <div className="w-3 p-3 h-3 bg-white border-2 border-green-500 rounded-full"></div>
                            </div>

                            {/* محتوا */}
                            <h2 className="text-[16px] md:text-[18px] text-[#101828] font-bold mr-3">
                                {section.title}
                            </h2>
                            <div className="text-[12px] md:text-[16px] text-[#667085] text-justify mx-3 mt-2">
                                {section.content}
                            </div>

                            {/* خط جداکننده بین بخش‌ها */}
                            {index !== sections.length - 1 && (
                                <hr className="hrsilver w-[90%] mx-auto mt-6" />
                            )}
                        </div>
                    ))}
                </div>
            </div>
        </div>
    );
};

export default Learn;
