const Learn = () => {
    return ( 
        <>
        <div className="block lg:flex lg:flex-col w-[70%] pr-3">
            <h1 className="text-[20px] md:text-[28px] text-[#101828] font-bold pr-3">چه چیزی یاد می‌گیریم؟</h1>
            <div className="block  ">
                <div className="first my-5">
                    <h1 className="text-[16px] md:text-[18px] mr-3 text-[#101828] font-bold">تحقیقات مبانی و طراحی UX</h1>
                    <span className="text-[12px] md:text-[16px] text-[#667085] text-justify mx-3 mt-2 block">طراحی محصول با درک نیازهای کاربران شروع می شود که از طریق تحقیقات جامع جمع آوری می شود. اصول اصلی طراحی انسان محور و نحوه حل مناسب یک مشکل طراحی را بیاموزید. درک نحوه همدلی با کاربران هنگام انجام تحقیقات کاربر، از جمله نحوه انجام مصاحبه های عمیق و ایجاد نظرسنجی های کمی، و استفاده از داده های تحقیق برای کشف فرصت ها. سپس روانشناسی را برای طراحی طرح ها به کار می گیرید و کاربر نهایی را در ذهن نگه می دارید.</span>
                </div>
                <hr className="hrsilver w-[90%] mx-auto" />
                <div className="second my-5">
                    <h1 className="text-[16px] md:text-[18px] mr-3 text-[#101828] font-bold">مفهوم نمونه سازی  Low-Fidelity</h1>
                    <span className="text-[12px] md:text-[16px] text-[#667085] text-justify mx-3 mt-2 block">بهترین محصولات بر اساس تحقیقات و بازخورد کاربران دورهای تکرار را پشت سر گذاشته اند. فرآیند یک سرعت طراحی را بیاموزید و چگونه یافته‌های تحقیق را به یک نمونه اولیه که می‌تواند با کاربران آزمایش شود، ترجمه کنید. درک چگونگی تقویت همکاری تیمی و استفاده از تفکر واگرا و همگرا برای ایجاد سریع نمونه های آزمایشی. اصول رابط کاربری را در طراحی یک نمونه اولیه قابل کلیک اعمال کنید و یک تست قابلیت استفاده را برای به دست آوردن بازخورد ارزشمند از کاربران که می تواند در تکرارهای طراحی استفاده شود، انجام دهید..</span>
                </div>
                <hr className="hrsilver w-[90%] mx-auto" />
                <div className="third my-5">
                    <h1 className="text-[16px] md:text-[18px] mx-3 text-[#101828] font-bold">نمونه سازی High-Fidelity تا تجزیه و تحلیل Post-Launch</h1>
                    <span className="text-[12px] md:text-[16px] text-[#667085] text-justify mx-3 mt-2 block">هنگامی که محصولات از نظر اثربخشی آزمایش شدند، باید برای تعامل تقویت شوند. اصول رابط کاربری پیشرفته را بیاموزید تا طرح های تعاملی بسازید که آماده تحویل به مهندسی برای بازخورد هستند. درک چگونگی درخواست و ادغام بازخورد از مهندسی برای بهبود طراحی قبل از آماده شدن برای توسعه. تعامل محصول را از طریق آزمایش قابلیت استفاده از راه دور و سایر روش‌های آزمایشی ارزیابی کنید. در نهایت، نحوه بهبود طراحی و تجربیات کاربر بر اساس داده‌های تعامل به منظور افزایش شاخص‌های کلیدی عملکرد را خواهید آموخت..</span>
                </div>
                <hr className="hrsilver w-[90%] mx-auto" />
                <div className="fourth my-5">
                    <h1 className="text-[16px] md:text-[18px] mr-3 text-[#101828] font-bold">CAPSTONE - طراحی نمونه کاره </h1>
                    <span className="text-[12px] md:text-[16px] text-[#667085] text-justify mx-3 mt-2 block">طراحان UX مهارت های خود را با نمایش طرح ها و فرآیندهای خود در یک نمونه کار نشان می دهند. درک آنچه باید و نباید در یک نمونه کارها گنجانده شود، و همچنین اجزای کلیدی که برای مخاطبان هدف جذاب هستند. یاد بگیرید که چگونه کار قبلی را سازماندهی کنید و با آن به صورت آنلاین ارتباط برقرار کنید و مخاطبان و اهداف شغلی خود را در نظر داشته باشید. چارچوب های داستان سرایی و برندسازی را برای ایجاد یک نمایه شخصی که ارزش پیشنهادی منحصر به فردی را منتقل می کند، اعمال کنید. همچنین بهترین روش‌ها را برای حفظ و به‌روزرسانی پورتفولیوی UX یاد خواهید گرفت.</span>
                </div>
            </div>

        </div>
        </>
     );
}
 
export default Learn;