const Description = () => {
  return (
    <>
      <div className="block px-3">
        <div className="block my-5">
          <h1 className="text-[#1D2939] text-[14px] font-bold my-3">
            درباره من
          </h1>
          <p className="text-[#667085] mb-3 text-[12px] text-justify ">
            وقتی اسکار هررا در مکزیک بزرگ می شد، والدین اسکار هررا یک بازی بازی
            داشتند. او مجذوب کنسول های بازی ویدیویی و نحوه کار آنها بود، اما در
            دبیرستان فقط به یک کلاس برنامه نویسی دسترسی داشت و نمی توانست در
            کالج شرکت کند.
          </p>
          <hr className="hrsilver w-[95%] mx-auto" />
        </div>
        <div className="block my-5">
          <h1 className="text-[#1D2939] text-[14px] font-bold my-3">
            چی باعث شد دوره خودتون رو در صدرا بگذرونید ؟
          </h1>
          <p className="text-[#667085] mb-3 text-[12px] text-justify ">
            وبهترین محصولات بر اساس تحقیقات و بازخورد کاربران دورهای تکرار را
            پشت سر گذاشته اند. فرآیند یک سرعت طراحی را بیاموزید و چگونه
            یافته‌های تحقیق را به یک نمونه اولیه که می‌تواند با کاربران آزمایش
            شود، ترجمه کنید. درک چگونگی تقویت همکاری تیمی و استفاده از تفکر
            واگرا و همگرا برای ایجاد سریع نمونه های آزمایشی. اصول رابط کاربری را
            در طراحی یک نمونه اولیه قابل کلیک اعمال کنید و یک تست قابلیت استفاده
            را برای به دست آوردن بازخورد ارزشمند از کاربران که می تواند در
            تکرارهای طراحی استفاده شود، انجام دهید.
          </p>
          <hr className="hrsilver w-[95%] mx-auto" />
        </div>
        <div className="block my-5">
          <h1 className="text-[#1D2939] text-[14px] font-bold my-3">
            قبل از صدرا مشغول چه کاری بودید ؟
          </h1>
          <p className="text-[#667085] mb-3 text-[12px] text-justify ">
            وهنگامی که محصولات از نظر اثربخشی آزمایش شدند، باید برای تعامل تقویت
            شوند. اصول رابط کاربری پیشرفته را بیاموزید تا طرح های تعاملی بسازید
            که آماده تحویل به مهندسی برای بازخورد هستند. درک چگونگی درخواست و
            ادغام بازخورد از مهندسی برای بهبود طراحی قبل از آماده شدن برای
            توسعه. تعامل محصول را از طریق آزمایش قابلیت استفاده از راه دور و
            سایر روش‌های آزمایشی ارزیابی کنید. در نهایت، نحوه بهبود طراحی و
            تجربیات کاربر بر اساس داده‌های تعامل به منظور افزایش شاخص‌های کلیدی
            عملکرد را خواهید آموخت.{" "}
          </p>
          <hr className="hrsilver w-[95%] mx-auto" />
        </div>
        <div className="block my-5">
          <h1 className="text-[#1D2939] text-[14px] font-bold my-3">
            نظرت درباره بوت کمپ طراحی رابط کاربری صدرا به ما می‌گی؟
          </h1>
          <p className="text-[#667085] mb-3 text-[12px] text-justify ">
            وطراحان UX مهارت های خود را با نمایش طرح ها و فرآیندهای خود در یک
            نمونه کار نشان می دهند. درک آنچه باید و نباید در یک نمونه کارها
            گنجانده شود، و همچنین اجزای کلیدی که برای مخاطبان هدف جذاب هستند.
            یاد بگیرید که چگونه کار قبلی را سازماندهی کنید و با آن به صورت
            آنلاین ارتباط برقرار کنید و مخاطبان و اهداف شغلی خود را در نظر داشته
            باشید. چارچوب های داستان سرایی و برندسازی را برای ایجاد یک نمایه
            شخصی که ارزش پیشنهادی منحصر به فردی را منتقل می کند، اعمال کنید.
            همچنین بهترین روش‌ها را برای حفظ و به‌روزرسانی پورتفولیوی UX یاد
            خواهید گرفت.
          </p>
          <hr className="hrsilver w-[95%] mx-auto" />
        </div>
      </div>
    </>
  );
};

export default Description;
